project_2/meshes/mesh_a_2/system/blockMeshDict

// Mesh generated on 08-Mar-2021
// Local directory: /Users/fbisetti/teaching/ASE347/SP-2021/OF-assignments/of2/simulations/mesh
// Username: fbisetti


// Lf (fore)  =  4.00000e+00
// Lw (wake)  =  6.00000e+00
// R  (outer) =  1.00000e+00
// H  (top/bottom) = 4.00000

FoamFile
{
    version  2.0;
    format   ascii;
    class    dictionary;
    object   blockMeshDict;
}

convertToMeters 1.0;

vertices
(
(0.5 0.0 -0.005) // 0
(0.3535533905932738 0.35355339059327373 -0.005) // 1
(3.061616997868383e-17 0.5 -0.005) // 2
(-0.35355339059327373 0.3535533905932738 -0.005) // 3
(-0.5 6.123233995736766e-17 -0.005) // 4
(-0.35355339059327384 -0.35355339059327373 -0.005) // 5
(-9.184850993605148e-17 -0.5 -0.005) // 6
(0.35355339059327373 -0.35355339059327384 -0.005) // 7
(1.0 0.0 -0.005) // 8
(0.7071067811865476 0.7071067811865475 -0.005) // 9
(6.123233995736766e-17 1.0 -0.005) // 10
(-0.7071067811865475 0.7071067811865476 -0.005) // 11
(-1.0 1.2246467991473532e-16 -0.005) // 12
(-0.7071067811865477 -0.7071067811865475 -0.005) // 13
(-1.8369701987210297e-16 -1.0 -0.005) // 14
(0.7071067811865475 -0.7071067811865477 -0.005) // 15
(6 0 -0.005) // 16
(6 0.7071067811865475 -0.005) // 17
(6 4 -0.005) // 18
(0.7071067811865476 4 -0.005) // 19
(0 4 -0.005) // 20
(-0.7071067811865475 4 -0.005) // 21
(-6 4 -0.005) // 22
(-6 0.7071067811865476 -0.005) // 23
(-6 0 -0.005) // 24
(-6 -0.7071067811865475 -0.005) // 25
(-6 -4 -0.005) // 26
(-0.7071067811865477 -4 -0.005) // 27
(0 -4 -0.005) // 28
(0.7071067811865475 -4 -0.005) // 29
(6 -4 -0.005) // 30
(6 -0.7071067811865477 -0.005) // 31
(0.5 0.0 0.005) // 32
(0.3535533905932738 0.35355339059327373 0.005) // 33
(3.061616997868383e-17 0.5 0.005) // 34
(-0.35355339059327373 0.3535533905932738 0.005) // 35
(-0.5 6.123233995736766e-17 0.005) // 36
(-0.35355339059327384 -0.35355339059327373 0.005) // 37
(-9.184850993605148e-17 -0.5 0.005) // 38
(0.35355339059327373 -0.35355339059327384 0.005) // 39
(1.0 0.0 0.005) // 40
(0.7071067811865476 0.7071067811865475 0.005) // 41
(6.123233995736766e-17 1.0 0.005) // 42
(-0.7071067811865475 0.7071067811865476 0.005) // 43
(-1.0 1.2246467991473532e-16 0.005) // 44
(-0.7071067811865477 -0.7071067811865475 0.005) // 45
(-1.8369701987210297e-16 -1.0 0.005) // 46
(0.7071067811865475 -0.7071067811865477 0.005) // 47
(6 0 0.005) // 48
(6 0.7071067811865475 0.005) // 49
(6 4 0.005) // 50
(0.7071067811865476 4 0.005) // 51
(0 4 0.005) // 52
(-0.7071067811865475 4 0.005) // 53
(-6 4 0.005) // 54
(-6 0.7071067811865476 0.005) // 55
(-6 0 0.005) // 56
(-6 -0.7071067811865475 0.005) // 57
(-6 -4 0.005) // 58
(-0.7071067811865477 -4 0.005) // 59
(0 -4 0.005) // 60
(0.7071067811865475 -4 0.005) // 61
(6 -4 0.005) // 62
(6 -0.7071067811865477 0.005) // 63
);

blocks
(

   // block 0
   hex (0 8 9 1 32 40 41 33) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 1
   hex (1 9 10 2 33 41 42 34) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 2
   hex (2 10 11 3 34 42 43 35) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 3
   hex (3 11 12 4 35 43 44 36) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 4
   hex (4 12 13 5 36 44 45 37) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 5
   hex (5 13 14 6 37 45 46 38) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 6
   hex (6 14 15 7 38 46 47 39) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 7
   hex (7 15 8 0 39 47 40 32) (10 20 1) simpleGrading ( 2.00000e+00  1.00000e+00 1.0)

   // block 8
   hex (8 16 17 9 40 48 49 41) (30 20 1) simpleGrading ( 4.00000e+00  1.00000e+00 1.0)

   // block 9
   hex (9 17 18 19 41 49 50 51) (30 30 1) simpleGrading ( 4.00000e+00  4.00000e+00 1.0)

   // block 10
   hex (10 9 19 20 42 41 51 52) (20 30 1) simpleGrading ( 1.00000e+00  4.00000e+00 1.0)

   // block 11
   hex (11 10 20 21 43 42 52 53) (20 30 1) simpleGrading ( 1.00000e+00  4.00000e+00 1.0)

   // block 12
   hex (23 11 21 22 55 43 53 54) (15 30 1) simpleGrading ( 2.50000e-01  4.00000e+00 1.0)

   // block 13
   hex (24 12 11 23 56 44 43 55) (15 20 1) simpleGrading ( 2.50000e-01  1.00000e+00 1.0)

   // block 14
   hex (25 13 12 24 57 45 44 56) (15 20 1) simpleGrading ( 2.50000e-01  1.00000e+00 1.0)

   // block 15
   hex (26 27 13 25 58 59 45 57) (15 30 1) simpleGrading ( 2.50000e-01  2.50000e-01 1.0)

   // block 16
   hex (27 28 14 13 59 60 46 45) (20 30 1) simpleGrading ( 1.00000e+00  2.50000e-01 1.0)

   // block 17
   hex (28 29 15 14 60 61 47 46) (20 30 1) simpleGrading ( 1.00000e+00  2.50000e-01 1.0)

   // block 18
   hex (29 30 31 15 61 62 63 47) (30 30 1) simpleGrading ( 4.00000e+00  2.50000e-01 1.0)

   // block 19
   hex (15 31 16 8 47 63 48 40) (30 20 1) simpleGrading ( 4.00000e+00  1.00000e+00 1.0)

);

edges
(

arc 0 1 ( 0.46193976625564337  0.1913417161825449 -0.005)
arc 1 2 ( 0.19134171618254492  0.46193976625564337 -0.005)
arc 2 3 ( -0.19134171618254486  0.46193976625564337 -0.005)
arc 3 4 ( -0.46193976625564337  0.19134171618254492 -0.005)
arc 4 5 ( -0.46193976625564337  -0.19134171618254484 -0.005)
arc 5 6 ( -0.19134171618254517  -0.46193976625564326 -0.005)
arc 6 7 ( 0.191341716182545  -0.4619397662556433 -0.005)
arc 7 0 ( 0.46193976625564326  -0.1913417161825452 -0.005)
arc 8 9 ( 0.9238795325112867  0.3826834323650898 -0.005)
arc 9 10 ( 0.38268343236508984  0.9238795325112867 -0.005)
arc 10 11 ( -0.3826834323650897  0.9238795325112867 -0.005)
arc 11 12 ( -0.9238795325112867  0.38268343236508984 -0.005)
arc 12 13 ( -0.9238795325112867  -0.38268343236508967 -0.005)
arc 13 14 ( -0.38268343236509034  -0.9238795325112865 -0.005)
arc 14 15 ( 0.38268343236509  -0.9238795325112866 -0.005)
arc 15 8 ( 0.9238795325112865  -0.3826834323650904 -0.005)
arc 32 33 ( 0.46193976625564337  0.1913417161825449 0.005)
arc 33 34 ( 0.19134171618254492  0.46193976625564337 0.005)
arc 34 35 ( -0.19134171618254486  0.46193976625564337 0.005)
arc 35 36 ( -0.46193976625564337  0.19134171618254492 0.005)
arc 36 37 ( -0.46193976625564337  -0.19134171618254484 0.005)
arc 37 38 ( -0.19134171618254517  -0.46193976625564326 0.005)
arc 38 39 ( 0.191341716182545  -0.4619397662556433 0.005)
arc 39 32 ( 0.46193976625564326  -0.1913417161825452 0.005)
arc 40 41 ( 0.9238795325112867  0.3826834323650898 0.005)
arc 41 42 ( 0.38268343236508984  0.9238795325112867 0.005)
arc 42 43 ( -0.3826834323650897  0.9238795325112867 0.005)
arc 43 44 ( -0.9238795325112867  0.38268343236508984 0.005)
arc 44 45 ( -0.9238795325112867  -0.38268343236508967 0.005)
arc 45 46 ( -0.38268343236509034  -0.9238795325112865 0.005)
arc 46 47 ( 0.38268343236509  -0.9238795325112866 0.005)
arc 47 40 ( 0.9238795325112865  -0.3826834323650904 0.005)

);

boundary
(

  inlet
  {
      type patch;
      faces
      (
         (22 54 55 23)
         (23 55 56 24)
         (24 56 57 25)
         (25 57 58 26)
      );
  }

  outlet
  {
      type patch;
      faces
      (
         (18 50 49 17)
         (17 49 48 16)
         (16 48 63 31)
         (31 63 62 30)
      );
  }

  cylinder
  {
      type wall;
      faces
      (
         (0 32 33 1)
         (1 33 34 2)
         (2 34 35 3)
         (3 35 36 4)
         (4 36 37 5)
         (5 37 38 6)
         (6 38 39 7)
         (7 39 32 0)
      );
  }

  top
  {
      type symmetryPlane;
      faces
      (
         (22 54 53 21)
         (21 53 52 20)
         (20 52 51 19)
         (19 51 50 18)
      );
  }

  bottom
  {
      type symmetryPlane;
      faces
      (
         (26 58 59 27)
         (27 59 60 28)
         (28 60 61 29)
         (29 61 62 30)
      );
  }

);
